Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: དེས་སྨྲས་པ། ལྷ་ཇི་ལྟར་དགྱེས་པ་བཞིན་དུ་མཛད་དུ་མཆིས་པར་བདག་གིས་བགྱི་བར་འཚལ་གྱིས། ཐུགས་མི་ཆུང་བར་གསོལ་ཞེས་བྱས་ནས་
en: “ ‘Not to worry, Deva,’ she said. ‘I shall act in accord with your wishes.’

source: དེས་དེ་ལ་ཕོ་ཉའི་ལན་སྤྲིང་སྟེ།
en: “Then she sent an envoy with the following message:

source: རྒྱལ་པོ་འདི་གསོན་པོར་འདུག་བཞིན་དུ་ནི། བདག་གིས་ཁྱོད་དང་མཇལ་བར་བགྱི་བའི་རྔོ་མི་ཐོགས་ཀྱིས་འདི་སོད་ཅིག་དང་། དེའི་འོག་ཏུ་བདག་དང་མཇལ་བར་འགྱུར་རོ་ཞེས་སྤྲིང་ངོ་། །
en: “ ‘Dear Brahmadatta, As my king yet lives, I shall not be able to meet you face to face. Dispatch with him! After that, I shall meet with you.’

source: དེ་ནས་ཚངས་པས་བྱིན་གྱིས་བསམས་པ་མི་འཐུན་པར་མ་བྱས་ཀྱི་བར་དུ་ནི། བདག་གིས་དེ་བསད་དུ་མི་རུང་གིས་ཕྱིར་ཡང་བདག་གིས་དེ་དང་མི་འཐུན་པར་བྱའོ་སྙམ་དུ་བསམས་ནས
en: “Brahmadatta thought, ‘Failing some dispute, I cannot kill him. Let me then fabricate some dispute with him.’

source: རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱིས་རྒྱལ་པོ་དབང་ཆེན་སྡེ་དང་ཕྱིར་ཡང་མི་འཐུན་པར་བྱས་ནས།
en: So King Brahmadatta began a dispute with King Mahendrasena.

source: དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་གོ་བསྐོན་ཏེ། ཡུལ་པི་དེ་ཧར་སོང་ནས། གྲོང་ཁྱེར་དཔུང་གི་ཚོགས་ཡན་ལག་བཞིས་བསྐོར་ཏེ་འདུག་གོ། །
en: He armed the four divisions of his army and advanced on Videha, where they besieged the city,

source: དེ་དེ་ན་འདུག་པས་སྐྱེ་བོ་ཕལ་པོ་ཆེ་ཁ་འདོག་པར་བྱེད་དོ། །
en: massacring many of the inhabitants in the siege.

source: དེ་ནས་དབང་ཆེན་སྡེའི་བཙུན་མོས་ཕྲིན་སྤྲིང་སྟེ།
en: “Thereupon Queen Mahendrasena sent an envoy with the following message:

source: ཁྱོད་འདིར་གཤེགས་པ་ཅི་ཡང་རུང་བ་དེ་དག་ཐམས་ཅད་ནི་བདག་གི་ཕྱིར་དུ་བས་ན་སྐྱེ་བོ་མང་པོ་དགུམ་ཅི་འཚལ་གྱིས།
en: “ ‘Dear Brahmadatta, If you have come here and done all this for my sake, then what need have we for so many to die?

source: ད་ཡང་མི་ཕལ་པའི་ཆ་ལུགས་སུ་ཞུགས་ལ་གྲོང་ཁྱེར་གྱི་ནང་དུ་གཤེགས་ཏེབདག་དང་མཇལ་བར་མཛད་དུ་གསོལ་ཞེས་སྤྲིང་ངོ་། །
en: By disguising yourself as an ordinary person you can come into the city to see me now.’

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་ཀཱ་ཤིའི་རྒྱལ་པོ་ཚངས་པས་བྱིན་ཐབས་ཇི་ལྟར་བསྟན་པ་བཞིན་དུ་རྒྱལ་པོའི་ཕོ་བྲང་གི་ནང་དུ་འོངས་སོ། །
en: “Now no sooner had King Brahmadatta of Kāśi heard this than he entered the royal palace by just the method she had suggested.

source: དེ་འོངས་མ་ཐག་ཏུ་དབང་ཆེན་སྡེའི་བཙུན་མོ་དེས་བཟུང་ནས། རྒྱལ་པོ་ལ་སྦྲན་ཏེ། ལྷ་ཚངས་པས་བྱིན་ནི་ལྷས་ཅི་དགྱེས་པར་མཛད་དུ་མཆིས་པར་གྱུར་ལགས་སོ་ཞེས་བྱས་སོ། །
en: When she saw him there, Queen Mahendrasena seized him, brought him before the king, and said, ‘Deva, here is Brahmadatta. Do with him as you please.’

source: དེ་ནས་རྒྱལ་པོ་དབང་ཆེན་སྡེས་རྒྱལ་པོའི་སྲས་དང་། བློན་པོ་དང་། ཚོང་དཔོན་དང་། ཕྱུག་པོ་དང་། དེད་དཔོན་ཐམས་ཅད་བསགས་ནས། ཀཱ་ཤིའི་རྒྱལ་པོ་ཚངས་པས་བྱིན་གྱི་མགོ་བོར་རྡོག་པས་བསྣུན་ཏེ་སྨྲས་པ།
en: “King Mahendrasena assembled all his princes and ministers, chiefs of merchandise, aristocrats, and caravan leaders, and they kicked Brahmadatta, King of Kāśi, in the head.

source: འདི་ཅི་ནས་ཕྱིན་ཆད་གཞན་གྱི་ཆུང་མ་ལ་བྱི་ཕོ་བྱེད་པར་མི་འགྱུར་བར་སོད་ཅིག་ཅེས་བྱས་སོ། །
en: “ ‘Let’s kill him, so he can never sleep with another man’s wife again!’ they cried.

source: དེ་ནས་རྒྱལ་པོ་དབང་ཆེན་སྡེ་ལ་བཙུན་མོས་གསོལ་པ།
en: Then the queen said to King Mahendrasena,

source: ལྷ་འདི་སྨ་ཕབ་པ་འདི་ཉིད་གུམ་པ་བས་ཆེས་ཐུབ་མ་ལགས་སམ།
en: ‘Deva, is this humiliation not worse than being killed?

source: ད་འདི་ལྷག་པར་དགུམ་དུ་ཅི་མཆིས་ཀྱིས་ཐོང་ལགས་ཞེས་གསོལ་ནས་གསོན་པོར་གཏང་ངོ་། །
en: What need is there now to kill him? Let him go.’ So they released him and spared his life.

source: དགེ་སློང་དག་ཇི་སྙམ་དུ་སེམས་དེའི་ཚེ་དེའི་དུས་ན་ཡུལ་པི་དེ་ཧའི་རྒྱལ་པོ་དབང་ཆེན་སྡེར་གྱུར་པ། བྱང་ཆུབ་ཀྱི་སྤྱོད་པ་ལ་གནས་པ་གང་ཡིན་པ་དེ་ནི་ང་ཉིད་ཡིན་ནོ། །
en: “O monks, what do you think? I am the one who was Mahendrasena, King of Videha then, and who lived the life of a bodhisattva.

source: དེའི་ཚེ་དེའི་དུས་ན་བཙུན་མོར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་ས་འཚོ་མ་འདི་ཉིད་ཡིན་ནོ། །
en: The one who was the queen then is none other than Gopā.

source: དེའི་ཚེ་ཀཱ་ཤིའི་རྒྱལ་པོ་ཚངས་པས་བྱིན་ཞེས་བྱ་བར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི། ལྷ་སྦྱིན་འདི་ཉིད་ཡིན་ཏེ།
en: The one who was King Brahmadatta of Kāśi then is none other than Devadatta.

source: དེའི་ཚེ་ཡང་དེས་འདི་མི་མང་སར་རྡོག་པས་བསྣུན་ཏེ་ཤིན་ཏུ་སྨ་ཕབ་བོ། །
en: At that time many people kicked and humiliated him, just as they have now.”

source: སྐྲ་ལྡན་མ་ཞེས་བྱ་བ་ནི།
en: The Story of Keśinī

source: བྱང་ཆུབ་སེམས་དཔའ་དགའ་ལྡན་གྱི་གནས་ན་བཞུགས་ཙམ་ན་ཡུལ་སེར་སྐྱའི་གནས་ན་རྒྱལ་པོ་སེང་གེའི་འགྲམ་རྒྱལ་པོ་བྱེད་དེ
en: When the Bodhisattva was dwelling in Tuṣita Heaven, King Siṃhahanu reigned in Kapilavastu.

source: དེ་བཙུན་མོ་དང་ལྷན་ཅིག་ཏུ་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་པ་ལས་སྔ་ཕྱིར་བུ་ཕོ་བཞི་དང་བུ་མོ་བཞི་བཙས་ཏེ་ཟས་གཙང་དང་ཟས་དཀར་དང་བྲེ་བོ་ཟས་དང་བདུད་རྩི་ཟས་དང་གཙང་མ་དང་དཀར་མོ་དང་བྲེ་བོ་མ་དང་བདུད་རྩི་མ་རྣམས་སོ། །
en: As he and the queens enjoyed themselves and coupled, the queens gave birth to four sons named Śuddhodana, Śuklodana, Droṇodana, and Amṛtodana, and four daughters named Śuddhā, Śuklā, Droṇā, and Amṛtā.

source: དེའི་ཚེ་ཡུལ་སྤོང་བྱེད་ན་རྒྱལ་པོ་ཤཱཀྱ་རབ་སད་གནས་ཏེ། དེའི་བཙུན་མོ་དང་ལྷན་ཅིག་ཏུ་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་པ་ལ་བུ་མོ་གཉིས་བཙས་ཏེ།
en: At the same time, as King Śākya Suprabuddha and his queens enjoyed themselves and coupled in Vṛji, the queens gave birth to two daughters.

source: གཅིག་གི་མིང་ནི་སྒྱུ་འཕྲུལ་ཞེས་བཏགས་སོ། །
en: One they named Māyā, [and the other Mahā­māyā.]

source: གཅིག་གི་མིང་ནི་སྒྱུ་འཕྲུལ་ཆེན་མོ་ཞེས་བཏགས་སོ། །
en: [One they named Māyā, and] the other Mahā­māyā.

source: དེ་ནས་དེ་གཉིས་འོ་མ་དང་། ཞོ་དང་། མར་དང་། ཞུན་མར་དང་། མར་གྱི་སྙིང་གུས་བསྐྱེད་བསྲིངས་ཏེ། མཚོའི་ནང་གི་པད་མ་བཞིན་དུ་སྐྱེ་དྲག་པར་གྱུར་ཏོ། །
en: They reared them on milk, yogurt, butter, ghee, and milk solids, and they flourished like lotuses in a lake.

source: དེ་ནས་དེ་གཉིས་ལ་མཚན་མཁན་རྣམས་ཀྱིས་བལྟས་ནས། བུ་མོ་སྒྱུ་འཕྲུལ་ལས་ནི་བུ་མཚན་ཕུན་སུམ་ཚོགས་པ་ཞིག་བཙའ་བར་འགྱུར་ལ། སྒྱུ་འཕྲུལ་ཆེན་མོ་ལས་ནི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་བཙའ་བར་འགྱུར་རོ་ཞེས་ལུང་བསྟན་ཏེ།
en: When the priests versed in reading signs examined them, they predicted that their daughter Māyā would give birth to a child of marvelous character, and that Mahā­māyā would give birth to a universal monarch.

source: དེ་གཉིས་ཀྱི་སྐྲ་ཏིལ་མར་གྱི་ཐིགས་པ་ཆུར་བླུགས་པ་བཞིན་དུ་རྒྱས་པར་གྱུར་ཏོ། །
en: Both daughters’ hair grew like a drop of sesame oil poured into water.

source: དེ་ནས་རྒྱལ་པོ་སེང་གེ་འགྲམ་གྱིས་ཐོས་ནས། རྒྱལ་པོ་རབ་སད་ལ་ཕོ་ཉ་བཏང་སྟེ།
en: When King Siṃhahanu heard this, he sent an envoy to King Śākya Suprabuddha with a message saying,

source: ཁྱོད་ཀྱི་བུ་མོ་དེ་གཉིས་བདག་གི་བུའི་ཆུང་མར་བྱིན་ཅིག །
en: “Betroth your two daughters to my son.

source: འདི་ན་ཤཱཀྱ་རྣམས་ཀྱིས་ནི་སུས་ཀྱང་ཐབས་ཟླར་བབ་པའི་ཆུང་མ་གཉིས་མི་བླང་བའི་ནང་ཁྲིམས་དེ་ལྟ་བུ་བཅས་མོད་ཀྱི། གལ་ཏེ་བདག་གིས་ཤཱཀྱ་རྣམས་ཀྱིས་དད་པ་གནང་བར་བྱེད་ནུས་ན་ཕྱིས་གཉི་ག་བླང་ངོ་ཞེས་སྤྲིང་ནས།
en: Though the Śākyas have an agreement among themselves that no one may take two wives in marriage, if I can get them to agree to this then you can marry them both.”

source: སེང་གེ་འགྲམ་གྱིས་ཤཱཀྱ་རྣམས་ལ་གསོལ་བ་བཏབ་ནས། དེའི་བུ་མོ་གཉི་ག་ཁྱིམ་ན་གནས་པ་རྣམས་ཀྱི་ཁྱིམ་པའི་ཆོས་བཞིན་དུ་བྱས་ཏེ་ཟས་གཙང་གི་བཙུན་མོར་བླངས་སོ། །
en: King Siṃhahanu made a request of all the Śākyas, and, in accord with the tradition among householders, Śuddhodana took both young women as his queens.

source: དེར་རྒྱལ་པོ་རབ་སད་ཀྱིས་དེ་གཉིས་ལ་བུ་མོ་སྐྲ་ལྡན་མ་ཞེས་བྱ་བ་སྐྲ་མཁན་དུ་བྱིན་ནོ། །
en: After marrying them, King Śākya Suprabuddha granted them a young woman named Keśinī to look after their hair.

source: དེ་ནས་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་བཙས་པ་ན། དེ་བཙས་ནས་ཞག་བདུན་ལོན་པའི་འོག་ཏུ་སྒྱུ་འཕྲུལ་ཆེན་མོ་ཤི་ནས་དེ་ཤི་བའི་འོག་ཏུ་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་ཡུལ་དུ་སྐྱེས་སོ། །
en: Seven days after the Bodhisattva’s birth, Mahā­māyā passed away and took rebirth in the Heaven of the Thirty-Three.

source: བུ་མོ་སྐྲ་ལྡན་མ་ནི་དེ་དང་བྲལ་བས་སྒྱུ་འཕྲུལ་ཆེན་མོའི་སྐྲ་ལ་འཇུས་ནས། ཤིན་ཏུ་མྱ་ངན་བྱེད་ཅིང་འབུབ་འདྲིལ་ལ་སྨྲེ་སྔགས་འདོན་ཅིང་བྲང་རྡུང་སྟེ།
en: Young Keśinī missed her so much that she clutched at strands of Mahā­māyā’s hair and flung herself on the ground in grief, wailing and beating her chest.

source: སུས་ཀྱང་དེའི་མྱ་ངན་བསང་མ་ནུས་སོ། །
en: She was inconsolable.

source: དེ་ནས་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སྐུ་ཆེར་འཁྲུངས་པ་དེའི་ཚེ། དེས་རྒན་པོ་དང་ནད་པ་དང་ཤི་བ་གཟིགས་ནས་ནགས་ཀྱི་ནང་དུ་རྟེན་བཅས་ཏེ།
en: When the Bodhisattva had grown, upon witnessing old age, sickness, and death, he went to live in the forest,

source: ལོ་དྲུག་གི་བར་དུ་དཀའ་བ་སྤྱད་ནས་བླ་ན་མེད་པའི་ཡེ་ཤེས་བརྙེས་ཏེ།
en: where he practiced austerities for six years until he achieved unexcelled wisdom.

source: མཐར་གྱིས་འདུལ་བའི་དོན་མཛད་ཅིང་ཡུལ་སེར་སྐྱའི་གནས་སུ་གཤེགས་སོ། །
en: His actions for the benefit of those to be tamed eventually led him to stay in Kapilavastu

source: དེ་དེར་གཤེགས་ནས་ཤཱཀྱ་རྣམས་རབ་ཏུ་ཕྱུང་ངོ་། །
en: and he led many Śākyas there to go forth,

source: སྐྱེ་དགུའི་བདག་མོ་ཆེན་མོ་གཽ་ཏ་མཱི་ཡང་རབ་ཏུ་ཕྱུང་ངོ་།
en: including Mahā­prajāpatī Gautamī.

source: སྐྲ་ལྡན་མ་ཡང་རབ་ཏུ་ཕྱུང་སྟེ། དེས་ཀྱང་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ཏེ། དེ་བཅོམ་ལྡན་འདས་ཀྱིས་བརྩོན་འགྲུས་བརྩམས་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་ཏོ། །
en: Keśinī too was not only ordained, she also cast away all afflictive emotions and manifested arhatship, and the Blessed One commended her for her superlative efforts.

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ།
en: Afterward, the monks asked the Blessed One,

source: བཙུན་པ་སྐྲ་ལྡན་མས་ལས་ཅི་བགྱིས་ན། ལས་དེའི་རྣམ་པར་སྨིན་པས་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བའི་ཤཱཀྱའི་རིགས་སུ་སྐྱེས་ལགས།
en: “Lord, what action did Keśinī take that ripened into her birth as a Śākya, into a family of great means, prosperity, and wealth?

source: ལས་ཅི་བགྱིས་ན་དེས་བྲན་མོ་གཞན་གྱི་མངག་གཞུག་བགྱིད་པར་གྱུར་ལགས།
en: What action did she take that ripened into her becoming a servant of other women?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སྨོན་ལམ་གྱི་དབང་ལས་གྱུར་ཏོ། །
en: “It came about by the power of her prayers,” replied the Blessed One.

source: འདིས་གང་དུ་སྨོན་ལམ་བཏབ་ལགས།
en: “Lord, where did she make these prayers?”

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། བསྐལ་པ་དགུ་བཅུ་རྩ་གཅིག་པ་ལ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ་འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམ་པར་གཟིགས་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ
en: “Monks, in times past, in the ninety-first eon, when the tathāgata, the arhat, the totally and completely awakened buddha possessed of insight and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Vipaśyin was in the world,

source: དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་གྲོང་ཁྱེར་གཉེན་ལྡན་དུ་གཤེགས་ཏེ།
en: after he fully and completely awakened unto unexcelled, total, and complete enlightenment, he visited the city of Bandhumatī.

source: དེ་ལྕམ་གཉིས་ཀྱིས་བཤོས་གསོལ་བ་ན། དེར་གཅིག་གིས་སྨོན་ལམ་བཏབ་པ། བདག་ལས་འདི་ལྟ་བུའི་སྐྱེས་བུ་རིན་པོ་ཆེ་བཙས་ཏེ།
en: “Two women there offered him food, and one of them prayed, ‘May I give birth to one as precious as this.

source: དེ་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: May I please and not displease him,’

source: བུ་མོ་ཅིག་ཤོས་ཀྱིས་སྨོན་ལམ་བཏབ་པ།
en: while the other prayed,

source: བདག་ཀྱང་གང་དང་གང་དུ་སྐྱེ་བ་དེ་དང་དེར་ཁྱོད་དང་སྤུན་དུ་གྱུར་ཅིག །
en: ‘Wherever I am born, may it be as your sibling.

source: བདག་འདི་ལྟ་བུའི་སྐྱེས་བུ་རིན་པོ་ཆེ་དེ་འཚོ་བར་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: May I rear one as precious as this.’

source: དེ་སྤུན་གཉིས་ཀྱི་སྐྲ་མཁན་བྱེད་པའི་བུ་མོ་དེ་ཡང་དེ་ན་འདུག་པར་གྱུར་ཏེ། བུ་མོ་དེས་ཀྱང་དེ་གཉིས་ཀྱི་སྨོན་ལམ་དེ་ལྟ་བུ་དེ་བཏབ་པ་ཐོས་ནས།
en: “The young woman who looked after the two sisters’ hair was also there, and she overheard them making their prayers.

source: ཐོས་མ་ཐག་ཏུ་དེས་ཀྱང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམ་པར་གཟིགས་ལ་བཀུར་སྟི་བྱས་ཏེ།
en: As soon as she heard them, she began to venerate the totally and completely awakened Buddha Vipaśyin herself,

source: སྨོན་ལམ་བཏབ་པ་ཀྱེ་མ་བདག་ཀྱང་དགེ་བའི་རྩ་བ་འདིས། འདི་གཉིས་གང་དང་གང་དུ་སྐྱེས་པ་དེ་དང་དེར་བདག་འདི་གཉིས་ཀྱི་སྐྲ་མཁན་མ་བསྙེན་བཀུར་བྱེད་པར་གྱུར་ནས།
en: praying, ‘Oh, but by this root of virtue, wherever these two are born, may I again look after their hair and serve them with great respect!

source: འདི་གཉིས་ཀྱི་བུ་རིན་པོ་ཆེ་དེ་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག་མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག་ཅེས་བྱས་ཏེ་
en: May I please and not displease their precious children.’

source: དེར་འདིས་སྨོན་ལམ་འདི་ལྟ་བུ་བཏབ་བོ། །
en: Such were her prayers.”

source: བཙུན་པ་ལས་ཅི་བགྱིས་ནའདིས་བཅོམ་ལྡན་འདས་ཀྱང་མཉེས་པར་བགྱིས་ཏེ་མི་མཉེས་པར་མ་བགྱིས་ཏེ།
en: “Lord, what action did she take that she pleased the Blessed One, and did not displease him;

source: བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས། ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ། དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བགྱིས་ནས།
en: that she went forth in the doctrine of the Blessed One, cast away all afflictive emotions, and manifested arhatship;

source: བཅོམ་ལྡན་འདས་ཀྱིས་བརྩོན་འགྲུས་བརྩམས་པ་རྣམས་ཀྱི་མཆོག་ཏུ་ཡང་བསྟན་ལགས།
en: and that the Blessed One also commended her for her superlative efforts?”

source: འདི་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་གསུང་རབ་ལ་རབ་ཏུ་བྱུང་སྟེགང་ལས་རབ་ཏུ་བྱུང་བའི་མཁན་མོ་དེ་ནི་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་བརྩོན་འགྲུས་བརྩམས་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་ཏོ། །
en: “She went forth in the doctrine of the totally and completely awakened Buddha Kāśyapa, and the preceptor who led her to go forth was also commended for her superlative efforts by the totally and completely awakened Buddha Kāśyapa.

source: དེ་ནས་དེས་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས། འཆི་ཀར་སྨོན་ལམ་བཏབ་པ།
en: “Then after practicing pure conduct all her life, at the time of her death she prayed,

source: འདི་ལྟར་བདག་གིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་གསུང་རབ་ལ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ཀྱང་། ཡོན་ཏན་གྱི་ཚོགས་ཅི་ཡང་མ་ཐོབ་ཀྱིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་བྲམ་ཟེའི་ཁྱེའུ་བླ་མ་ལུང་བསྟན་པ་གང་ཡིན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་བདག་གིས་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག །
en: ‘While I may not have attained any great virtues, still I have gone forth in the teaching of the totally and completely awakened Buddha Kāśyapa and practiced pure conduct all my life. Therefore, may I please and not displease Uttara, the young brahmin prophesied by the totally and completely awakened Buddha Kāśyapa to be the next blessed buddha.

source: ཇི་ལྟར་བདག་གིས་མཁན་མོ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་བརྩོན་འགྲུས་བརྩམས་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་པ་དེ་བཞིན་དུ་བདག་ཀྱང་ཤཱཀྱ་ཐུབ་པ། ཤཱཀྱའི་རྒྱལ་པོ་དེས་བརྩོན་འགྲུས་བརྩམས་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་པར་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: Just as the totally and completely awakened Buddha Kāśyapa commended my preceptor for her superlative efforts, may Buddha Śākyamuni, king of the Śākyas, also commend me for my superlative efforts.’

source: དེའི་ཚེ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་བའི་དགེ་སློང་མ་གང་ཡིན་པ་དེ་ནི་སྐྲ་ལྡན་མ་འདི་ཉིད་ཡིན་ཏེ
en: The one who went forth in the doctrine of the totally and completely awakened Buddha Kāśyapa and became a nun then is this very Keśinī.

source: དེས་དེར་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས་འཆི་ཀར་སྨོན་ལམ་བཏབ་སྟེ།
en: There she practiced pure conduct all her life, and at the time of her death, she prayed,

source: དེའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱེད་པར་གྱུར་ཅིག །
en: Going forth in his doctrine alone may I cast away all afflictive emotions, and manifest arhatship.

source: ཇི་ལྟར་བདག་གི་མཁན་མོ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་བརྩོན་འགྲུས་བརྩམས་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་པ་དེ་བཞིན་དུ་བདག་ཀྱང་ཤཱཀྱ་ཐུབ་པ་ཤཱཀྱའི་རྒྱལ་པོ་དེས་བརྩོན་འགྲུས་བརྩམས་པ་རྣམས་ཀྱི་མཆོག་ཏུ་ལུང་བསྟན་པར་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: Just as the totally and completely awakened Buddha Kāśyapa commended my preceptor for her superlative efforts, may Buddha Śākyamuni, king of the Śākyas, also commend me for my superlative efforts.’

source: འདིས་ང་མཉེས་པར་བྱས་ཏེ་མི་མཉེས་པར་མ་བྱས་ལ།
en: that she has pleased me, not displeased me,

source: ང་ཉིད་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་
en: gone forth in my very doctrine,

source: ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་
en: cast away all afflictive emotions,

source: དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ནས
en: and manifested arhatship,

source: ད་ལྟར་ངས་བརྩོན་འགྲུས་བརྩམས་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་ཏོ།། །།
en: and that I have now commended her for her superlative efforts.”

source: པད་མའི་མདོག་ཅེས་བྱ་བ་ནི།
en: The Story of Lotus Color

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེའི་ཚེ་ཚེ་དང་ལྡན་པ་ཉེ་སྡེ་ཡུལ་སྲུང་བྱེད་དུ་ལྗོངས་རྒྱུ་ཞིང་སོང་བ་ལས་རི་ཁྲོད་ཅིག་ཏུ་ཕྱིན་ཏེ་
en: Once when the Blessed One was in Śrāvastī, Venerable Upasena was making his way through the countryside in the country of Avanti, where in time he came to a mountainside hermitage.

source: དེའི་ཚེ་རི་ཁྲོད་དེ་ན། ཁྱིམ་བདག་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བ། ཡོངས་སུ་འཛིན་པ་ཡངས་ཤིང་རྒྱ་ཆེ་བ། རྣམ་ཐོས་བུའི་ནོར་དང་ལྡན་པ། རྣམ་ཐོས་ཀྱི་བུའི་ནོར་དང་འགྲན་པ་ཞིག་གནས་པ་དེས་ཐབས་ཟླར་བབ་པ་ལས་ཆུང་མ་བླངས་ནསདེ་དེ་དང་ལྷན་ཅིག་ཏུ་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་དོ། །
en: Now at that time in the mountainside hermitage there lived a certain householder, prosperous and wealthy, a person of vast and magnificent means, endowed with the wealth of Vaiśravaṇa—with wealth to rival Vaiśravaṇa’s. When the time came for him to marry he took a wife, and they enjoyed themselves and coupled.

source: དེ་རྩེ་ཞིང་དགའ་ལ་དགའ་མགུར་སྤྱོད་ཀྱང་ཁྱིམ་བདག་དེ་བུ་མེད་ནས་
en: But even though they enjoyed themselves and coupled, they had no children.

source: དེ་ལག་པ་ལ་རྐོམ་ཚུགས་བཅས་ཏེ་བསམས་པ།
en: Head in hands, the householder sat and brooded, thinking,

source: བདག་གི་ཁྱིམ་ནོར་དུ་མ་དང་ལྡན་དུ་ཟིན་ཀྱང་བདག་ལ་བུ་ཡང་མེད་བུ་མོ་ཡང་མེད་པས། བདག་འདས་པའི་འོག་ཏུ་ནི་བུ་མེད་པའི་ཕྱིར་ཅི་བདོག་པ་ཐམས་ཅད་རྒྱལ་པོ་དབང་བར་འགྱུར་རོ་སྙམ་སྟེ་
en: “My house may be filled with all kinds of riches, but seeing as I have no heir, after I die, all I have will become property of the king.”

source: དེ་ནས་དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དང་། ལྟས་མཁན་དང་། མཛའ་བོ་དང་། གཉེན་དང་། རྩ་ལག་གཞན་དག་གིས་ལྷ་ལ་གསོལ་བ་ཐོབ་ཤིག་ཅེས་དེ་ལ་བསྒོའོ། །
en: The ascetics and brahmins, fortune tellers, his friends, his close family, and his other kin all told him, “You should supplicate a deity.”

source: དེ་ནས་དེ་བུ་མེད་དེ་བུ་འདོད་པའི་ཕྱིར་ལྷ་གུ་ལང་དང་། ཆུ་ལྷ་དང་། ཀུ་བེ་ར་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་ལ་སོགས་པ་དང་། ལྷའི་ཁྱད་པར་གཞན་དག་ལ་ཡང་གསོལ་བ་འདེབས་ཏེའདི་ལྟ་སྟེ། ཀུན་དགའ་ར་བའི་ལྷ་དང་། ནགས་ཚལ་གྱི་ལྷ་དང་། ལམ་གྱི་བཞི་མདོའི་ལྷ་དང་། སུམ་མདོའི་ལྷ་དང་། གཏོར་མ་ལེན་པའི་ལྷ་དང་། ལྷན་ཅིག་སྐྱེས་པ་དང་། ཆོས་འཐུན་པ་དང་། རྟག་ཏུ་ཕྱི་བཞིན་འབྲང་བའི་ལྷ་རྣམས་ལ་ཡང་གསོལ་བ་འདེབས་ཏེ
en: So, since he had no heir and desired a son, he supplicated the gods. He prayed to Paśupati, Varuṇa, Kubera, Śakra, Brahmā, and the rest, and to the deities of the pleasure groves, the forest deities, the deities of the crossroads, the deities of forks in the road, the deities who receive strewn oblations, the deities of his inherited tradition, and the deities who are in constant attendance of righteous persons.

source: འཇིག་རྟེན་ན་ཡང་གསོལ་བ་བཏབ་པའི་རྒྱུས་བུ་དང་བུ་མོ་སྐྱེ་བར་འགྱུར་རོ་ཞེས་བགྱི་བའི་གཏམ་དེ་ཡོད་མོད་ཀྱི་དེ་ཡང་དེ་ལྟ་ནི་མ་ཡིན་ཏེ།
en: While it is often said that praying to the deities can cause a boy or a girl to be born, this is not true.

source: ཡེ་ནི་གནས་གསུམ་ཚོགས་པ་ལས་བུ་དང་བུ་མོ་སྐྱེ་བར་འགྱུར་ཏེ། གསུམ་གང་ཞེ་ན། ཕ་མ་གཉིས་འདོད་ཆགས་ལངས་ཏེ་ཕྲད་པ་དང་། མ་དུས་ལ་བབ་ཅིང་ཟླ་མཚན་དང་ལྡན་པ་དང་དྲི་ཟ་འོངས་པ་སྟེ། གནས་འདི་གསུམ་ཚོགས་པ་ལས་བུ་དང་བུ་མོ་སྐྱེ་བར་འགྱུར་རོ། །
en: In fact, there are three circumstances that allow for the birth of a child: a child is born when (1) lust arises in the parents and they have intercourse, (2) the mother still has her menstrual cycle and is approached by a gandharva, and (3) the gandharva’s mind is either attached or angry.

source: དེ་ནས་དེ་ཡང་གསོལ་བ་འདེབས་པ་ལྷུར་བྱེད་ཅིང་འདུག་ལ། སེམས་ཅན་ཞིག་ཀྱང་སེམས་ཅན་གྱི་རིས་ཤིག་ནས་ཤི་འཕོས་ཏེ། དེའི་ཆུང་མའི་ལྟོར་ཞུགས་སོ། །
en: Nevertheless, he remained intent on his prayers, and a great being took birth in his wife’s womb

source: ལྔ་གང་ཞེ་ན། སྐྱེས་པ་ཆགས་པ་ཡང་ཤེས་ལ་མ་ཆགས་པ་ཡང་ཤེས་པ་དང་། དུས་ཀྱང་ཤེས་ལ་ཟླ་མཚན་ཡང་ཤེས་པ་དང་བུ་ཆགས་པ་ཤེས་པ་དང་། གང་ལས་བུ་ཆགས་པར་ཤེས་པ་དང་ཁྱེའུ་ཡང་ཤེས་ལ་བུ་མོ་ཡང་ཤེས་པ་སྟེ།
en: She knows (1) whether a man is attracted to her, (2) the time of her menstrual cycle, (3) that she has conceived, (4) from whom she has conceived, and (5) whether the child is a boy or a girl,

source: གལ་ཏེ་ཁྱེའུ་ཡིན་ན་ནི། ལྟོ་གཡས་ལོགས་སུ་རྟེན་ཅིང་གནས་སོ། །
en: for if it is a baby boy it will stay on the right side of the womb,

source: གལ་ཏེ་བུ་མོ་ཡིན་ན་ནི་ལྟོ་གཡོན་ལོགས་སུ་རྟེན་ཅིང་གནས་སོ། །
en: and if it is a girl it will stay on the left side of the womb.

source: དེ་ནས་དེ་དགའ་ཆེས་ནས་ཁྱིམ་ཐབ་ལ་སྦྲན་པ།
en: When the householder’s wife conceived a child she was overjoyed and told her husband,

source: བདག་གི་རུམ་གཡས་ལོགས་སུ་རྟེན་ཅིང་གནས་པ་ལས་ན་ཁྱེའུར་འགྱུར་བར་ངེས་ཀྱིས་དགྱེས་པ་བསྐྱེད་དུ་གསོལ་ཞེས་བྱས་ནས།
en: He is staying on the right side of my womb, so rejoice, for it is sure to be a boy!”

source: དེ་ཡང་དགའ་ཆེས་ཏེ་རོ་སྟོད་ནི་བཏེག་ལག་པ་གཡས་པ་ནི་བརྐྱང་ནས་
en: At this the householder too was very happy. He puffed out his chest, put his right hand in the air, and expressed his joy, saying,

source: བདག་གི་བུ་རུང་བར་གྱུར་ཅིག །མི་རུང་བར་མ་གྱུར་ཅིག །བདག་གི་བྱ་བ་དག་བྱེད་པར་ཤོག་ཅིག །
en: May everything be right with my son, may nothing go wrong with him, and may he carry on my work!

source: གསོས་པའི་ལན་ཕྱིར་གསོ་བར་ཤོག་ཅིག །
en: As I care for him, may he care for me in return!

source: བདག་གི་རིགས་རྒྱུད་རིང་དུ་གནས་པར་ཤོག་ཅིག །
en: May my lineage endure for a long time!

source: བདག་ཅག་འདས་ཏེ་ཤི་བའི་འོག་ཏུ་ཡང་བདག་ཅག་གི་ཕྱིར་མང་ཡང་རུང་ཉུང་ཡང་རུང་སྟེ། སྦྱིན་པ་དག་བྱིན་ལ་བསོད་ནམས་དག་བྱས་ནས།
en: And after our passing, when we die, may he give gifts, be they great or small, and make merit!

source: དེ་གཉིས་གང་དང་གང་དུ་སྐྱེས་ཤིང་འགྲོ་བ་དེར་འདི་སོང་ཅིག་ཅེས་ཡོན་སྔོ་བར་ཤོག་ཅིག་ཅེས་དགའ་བའི་ཚིག་བརྗོད་དོ། །
en: When he does, may he dedicate the merit thus: ‘Wherever these two are born, may this go to them!’ ”

source: དེ་ནས་དེས་བུ་ཆགས་པར་རིག་ནས་བུའི་རིམ་གྲོ་བྱ་བའི་ཕྱིར་ཁང་བཟངས་ཀྱི་སྟེང་དུ་ཉམ་རངས་སུ་བཞག་སྟེ་
en: Now that he knew his wife was pregnant, he ensconced her on the upper levels of their house in order to care for the baby.

source: གྲང་བའི་ཚེ་གྲང་བའི་ཡོ་བྱད་རྣམས་དང་ཚ་བའི་ཚེ་ཚ་བའི་ཡོ་བྱད་རྣམས་དང་། སྨན་པས་བསྟན་པའི་ཟས་རྣམས་དང་། ཧ་ཅང་ཁ་བ་མ་ཡིན་པ་རྣམས་དང་། ཧ་ཅང་སྐྱུར་བ་མ་ཡིན་པ་རྣམས་དང་། ཧ་ཅང་ལན་ཚྭ་ཆེ་བ་མ་ཡིན་པ་རྣམས་དང་། ཧ་ཅང་མངར་བ་མ་ཡིན་པ་རྣམས་དང་། ཧ་ཅང་རོ་ཚ་བ་མ་ཡིན་པ་རྣམས་དང་། ཧ་ཅང་བསྐ་བ་མ་ཡིན་པ་རྣམས་ཏེ། ཁ་བ་དང་། སྐྱུར་བ་དང་། ལན་ཚྭ་དང་། མངར་བ་དང་། ཚ་བ་དང་། བསྐ་བ་མེད་པའི་ཟས་རྣམས་ཀྱིས་བསྟེན་ཅིང་དོ་ཤལ་དང་།
en: He provided her with what she needed for winter in the winter, what she needed for summer in the summer, with food that was not too bitter, too sour, too salty, too sweet, too spicy, or too astringent as instructed by the healer, and he served her food that was not bitter, sour, salty, sweet, spicy, or astringent.

source: སེ་མོ་དོས་ལུས་རྣམ་པར་བཀླུབས་ཏེ། ལྷའི་བུ་མོ་དགའ་བའི་ཚལ་ན་རྣམ་པར་རྒྱུ་བ་བཞིན་དུ་ཁྲིའི་སྟེང་ནས་ཁྲིའི་སྟེང་དང་། ཁྲིའུའི་སྟེང་ནས་ཁྲིའུའི་སྟེང་དུ་རྒྱུ་ཞིང་འོག་གི་ས་གཞི་ལ་མི་འབབ་པ་དང་དེས་ཡིད་དུ་མི་འོང་བའི་སྒྲ་སྐད་ཅི་ཡང་མི་ཐོས་པར་བྱས་སོ། །
en: He draped her body with garlands and strings of precious stones, and he moved her from divan to divan and seat to seat like a goddess through a joyous garden, never letting her descend to the ground, and never letting her hear an unpleasant word even for a moment.

source: དེ་ནས་དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་བུ་བྱུང་སྟེ། ཁྱེའུ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་མདོག་བཟང་བ་པད་མའི་སྙིང་པོའི་མདོག་འདྲ་བ། མགོ་བོ་གདུགས་ལྟར་འདུག་པ། ལག་པ་རིང་བ་དང་དཔྲལ་བའི་དབྱེས་ཆེ་བ། སྣ་མཐོ་བ། སྣ་ལེགས་པ། སྨིན་མ་སྟུག་པ་ཞིག་བཙས་ནས
en: Then after nine or ten months had passed, she gave birth to a child who was well proportioned, pleasing to the eye, and beautiful, with a fine complexion the color of the center of a lotus, a well-rounded head, long arms, a broad brow, a fine and prominent nose, and eyebrows that met.
